
&НаКлиенте
Процедура СоздатьНовуюАнкету(Команда)
	
	ДатаНачала = ТекущаяДата();
	ДатаОкончания = КонецМесяца(ДатаНачала);
	
	ПараметрыОткрытия = Новый Структура;
	ДанныеЗаполнения = Новый Структура("Мероприятие,ДатаНачала,ДатаОкончания",ПредопределенноеЗначение("Перечисление.ВидыАнкетаОпрос.Анкетирование"),ДатаНачала,ДатаОкончания);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Справочник.АнкетыИОпросы.ФормаОбъекта",ПараметрыОткрытия);
	//Сообщить("Можно создать новую анкету для клиента Почты России");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйОпрос(Команда)
	
	ДатаНачала = ТекущаяДата();
	ДатаОкончания = КонецМесяца(ДатаНачала);
	
	ПараметрыОткрытия = Новый Структура;
	ДанныеЗаполнения = Новый Структура("Мероприятие,ДатаНачала,ДатаОкончания",ПредопределенноеЗначение("Перечисление.ВидыАнкетаОпрос.Опрос"),ДатаНачала,ДатаОкончания);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Справочник.АнкетыИОпросы.ФормаОбъекта",ПараметрыОткрытия);
	//Сообщить("Позволит создать новые опросы для населения/клиентов Почты России");
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьПроведеннныеАнкетыОпросы(Команда)
	
	ОткрытьФорму("Документ.ПроведениеАнкетированияОпросов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчётыПоРезультатамПроведенияАнкетИОпросо(Команда)
	
	Сообщить("Открывает окошко с выбором аналитических отчётиков по результатам опросов и проведения анкет. Ведь интересно узнать всякое о группах населения.");
	
КонецПроцедуры
