
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения = Параметры.ТекстСообщения;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработкаСотрудникУдален = Новый ОписаниеОповещения("ЗавершитьРаботу_СотрудникУдален",ЭтаФорма);
	ПоказатьПредупреждение(ОбработкаСотрудникУдален,ТекстСообщения,3,":(");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу_СотрудникУдален(ДополнительныеПараметры) Экспорт
	
		ЗавершитьРаботуСистемы(Ложь);
		
КонецПроцедуры
