#Область ПрограммныйИнтерфейс

Функция ПрохождениеПроверкиПриНачалеРаботыСистемы() Экспорт
	
	РезультатПроверки_УстановленТекущийПользователь = УстановленТекущийПользователь();
	Если РезультатПроверки_УстановленТекущийПользователь = Ложь Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени("Новый сотрудник");
		Если ПользовательИБ = Неопределено Тогда
			НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		    НовыйПользователь.Имя = "Новый сотрудник";
		    НовыйПользователь.ПолноеИмя = НовыйПользователь.Имя;
		    НовыйПользователь.АутентификацияСтандартная = Истина;
		    НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		    НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
		    НовыйПользователь.Записать(); 
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатПроверки = Новый Структура("НовыйСотрудник,СотрудникУдален");
	РезультатПроверки.НовыйСотрудник = РезультатПроверки_УстановленТекущийПользователь = Ложь;
	РезультатПроверки.СотрудникУдален = ПараметрыСеанса.СотрудникУдалён;
	
	Возврат  РезультатПроверки;
	
КонецФункции

Функция ЗаписатьКэшКартыOSM() Экспорт
	
	КаталогКэша = КаталогВременныхФайлов();
		
	Разделитель = ОбщегоНазначенияКлиентСервер.РазделительВПутиФайлов(КаталогКэша);		
	
	Если Прав(КаталогКэша,1) = Разделитель Тогда
		КаталогКэша = Лев(КаталогКэша,СтрДлина(КаталогКэша)-1);
	КонецЕсли;
	
	ПутьКэша = КаталогКэша+Разделитель+"КартыOSM";
	КаталогКэшаКартыOSM = Новый Файл(ПутьКэша);
	
	ПутьФайла = ПутьКэша+Разделитель+"index.html";
	ФайлКэшаJSON = Новый Файл(ПутьФайла);	
	
	КаталогКэшаСуществует =  КаталогКэшаКартыOSM.Существует();
	
	Если Не КаталогКэшаСуществует Или НЕ ФайлКэшаJSON.Существует() Тогда
		
		Если Не КаталогКэшаСуществует Тогда 
			СоздатьКаталог(ПутьКэша);
		КонецЕсли;
		
		ДвоичныеДанные_КартыOSM = ПолучитьОбщийМакет("КартыOSM");
		ДвоичныеДанные_КартыOSM.Записать(ПутьФайла);		
		ДвоичныеДанные_КартыOSM = Неопределено;
		
	Иначе
		
		ВерсияПрежняя = Константы.Версия.Получить();
		Если НЕ ВерсияПрежняя = Метаданные.Версия Тогда
			
			 Константы.Версия.Установить(Метаданные.Версия);
			 
			 УдалитьФайлы(ПутьКэша);
			 
			СоздатьКаталог(ПутьКэша);
			 
			 ДвоичныеДанные_КартыOSM = ПолучитьОбщийМакет("КартыOSM");
			 ДвоичныеДанные_КартыOSM.Записать(ПутьФайла);		
			 ДвоичныеДанные_КартыOSM = Неопределено;

		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ПутьФайла;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановленТекущийПользователь()
	
	Заполнено = ЗначениеЗаполнено(ТекущийПользователь());
		
	Возврат Заполнено;
	
КонецФункции

#КонецОбласти