
#Область ПрограммныйИнтерфейс

Процедура УдалитьИдентификаторBase1CИзГипертекста(ТекстHTML) Экспорт
	
	ПозицияBase = СтрНайти(ТекстHTML, "<base", НаправлениеПоиска.СКонца);
	Если ПозицияBase > 0 Тогда
		ПозицияЗавершениеBase = СтрНайти(ТекстHTML, ">", НаправлениеПоиска.СНачала, ПозицияBase);
		Если ПозицияЗавершениеBase > 0 Тогда		
			    ТекстHTML = Лев(ТекстHTML, ПозицияBase-1) + Сред(ТекстHTML, ПозицияЗавершениеBase+1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТекущиеГеокоординаты() Экспорт

    #Если МобильноеПриложениеКлиент Тогда

        ТекущийПровайдер = "gps";

        Попытка

            ДМ = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ТекущийПровайдер);

        Исключение

            ДМ = Неопределено;

        КонецПопытки;

        Если ДМ = Неопределено Тогда

            ТекущийПровайдер = "network";

            Попытка

                ДМ = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ТекущийПровайдер);

            Исключение

                ДМ = Неопределено;

            КонецПопытки;

        КонецЕсли;

		Если ТекущаяДата() - МестноеВремя(ДМ.Дата) > 300 Тогда

            СредстваГеопозиционирования.ОбновитьМестоположение(ТекущийПровайдер, 5);
            ДМ = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ТекущийПровайдер);

        КонецЕсли;
		
        Если ДМ = Неопределено Тогда

            Возврат Неопределено;

        КонецЕсли;

		//{--  21.10.2020 6:42:50 ,
		//--  ненужный функционал
		// ДА = ПолучитьАдресПоМестоположению(ДМ.Координаты);
		//Если ДА = Неопределено Тогда

		//    ТекущееМестоположение =  "Lat: " + ДМ.Координаты.Широта + ", Lon: " + ДМ.Координаты.Долгота;

		//Иначе

		//    ТекущееМестоположение = СтрЗаменить(ДА.Представление, Символы.ПС, ", ");

		//КонецЕсли;
		// ТекущееМестоположение = ТекущееМестоположение + "Date: " + МестноеВремя(ДМ.Дата) + ", Provider: " + ТекущийПровайдер;

		//Возврат ДМ.Координаты;

		//--  21.10.2020 6:42:50 , }
       //{++  21.10.2020 6:43:06 ,
	   
	   Ответ = Новый Структура;
	   Ответ.Вставить("Широта",  ДМ.Координаты.Широта);
	   Ответ.Вставить("Долгота",  ДМ.Координаты.Долгота);
	   //++  21.10.2020 6:43:06 , }

	   Возврат Ответ;
       
    #Иначе

        Возврат Неопределено;

    #КонецЕсли

КонецФункции

#КонецОбласти