
&НаКлиенте
Процедура МаршрутыДоставки(Команда)
	ОткрытьФорму("Обработка.НавигацияМаршрутыДоставки.Форма");
КонецПроцедуры

&НаКлиенте
Процедура АнкетированиеИОпросы(Команда)
	ОткрытьФорму("Обработка.НавигацияАнкетированиеИОпросы.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыТоваровИУслуг(Команда)
	ОткрытьФорму("Обработка.НавигацияЗаказТоваровИУслуг.Форма");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьЗаголовокСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокСервер()
	
	Если НЕ ПараметрыСеанса.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		
		Элементы.НадписьЗаголовок.Заголовок = "Хорошего вам дня,
		|"+ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.Сотрудник, "Наименование");
		
	Иначе
	
	    Элементы.НадписьЗаголовок.Заголовок = "Хорошего вам дня";
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСтандартныйЗаголовокГлавногоМеню" Тогда
		
		    ОбновитьЗаголовокСервер();
		
	КонецЕсли;
	
КонецПроцедуры
