
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сотрудник = ПараметрыСеанса.Сотрудник;
	КонецЕсли;
	
	
	ПолучитьДанныеАнкеты(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеАнкеты(ОткрытиеОбъекта = Ложь)
	
	Если НЕ ОткрытиеОбъекта Тогда
		Объект.Вопросы.Очистить();
		Ответы.Очистить();
	Иначе
		Для Каждого Стр Из Объект.Вопросы Цикл
		 	Стр.ТекущийВариантОтвета = Стр.ВариантОтвета;
		КонецЦикла;
	КонецЕсли;
	СписокВыбора =  Элементы.ВопросыВариантОтвета.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.АнкетаОпрос) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.АнкетаОпрос,"Мероприятие,Партнёр");
	Если Данные.Мероприятие = Перечисления.ВидыАнкетаОпрос.Анкетирование  Тогда
		Элементы.Клиент.Видимость = Истина;		
	Иначе	
		Элементы.Клиент.Видимость = Ложь;
	КонецЕсли; 
	
	Элементы.ВопросыВариантОтвета.ВыбиратьТип=Ложь;
	Элементы.ВопросыВариантОтвета.РежимВыбораИзСписка = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АнкетыИОпросыВопросы.Вопрос КАК Вопрос
	               |ПОМЕСТИТЬ Вопросы
	               |ИЗ
	               |	Справочник.АнкетыИОпросы.Вопросы КАК АнкетыИОпросыВопросы
	               |ГДЕ
	               |	АнкетыИОпросыВопросы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АнкетыИОпросыВопросы.Вопрос
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вопросы.Вопрос КАК Вопрос,
	               |	АнкетыИОпросыВопросы.ВариантОтвета КАК ВариантОтвета
	               |ИЗ
	               |	Вопросы КАК Вопросы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АнкетыИОпросы.Вопросы КАК АнкетыИОпросыВопросы
	               |		ПО Вопросы.Вопрос = АнкетыИОпросыВопросы.Вопрос
	               |ГДЕ
	               |	АнкетыИОпросыВопросы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Вопросы.Вопрос,
	               |	АнкетыИОпросыВопросы.ВариантОтвета
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВариантОтвета)
	               |ПО
	               |	Вопрос";	
	Запрос.УстановитьПараметр("Ссылка", Объект.АнкетаОпрос);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВопрос = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	

	Пока ВыборкаВопрос.Следующий() Цикл
		НоваяСтрока = Ответы.Добавить();
		НоваяСтрока.Вопрос = Строка(ВыборкаВопрос.Вопрос);
		
		Выборка = ВыборкаВопрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока.ВариантОтвета.Добавить(Строка(Выборка.ВариантОтвета));
		КонецЦикла;
		  НоваяСтрока.ВариантОтвета.Добавить("Другое");
	  КонецЦикла;
	  
	  Для каждого ВопросОтвет Из Ответы Цикл
		  Если НЕ Объект.Вопросы.НайтиСтроки(Новый Структура("Вопрос", ВопросОтвет.Вопрос)).Количество() Тогда
		  	ОбъектВопросы = Объект.Вопросы.Добавить();	
		  	ОбъектВопросы.Вопрос =   ВопросОтвет.Вопрос;
		КонецЕсли;
	  КонецЦикла;
	  
КонецПроцедуры

&НаКлиенте
Процедура АнкетаОпросПриИзменении(Элемент)
	ПолучитьДанныеАнкеты();
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВариантОтветаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Вопросы.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЯчейкиЗаполнены", ЭтаФорма, ТекСтрока);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Ответы Цикл
		
		ДанныеВыбора.Добавить();
		МассивЗначений = СтрокаТЧ.ВариантОтвета.ВыгрузитьЗначения();
		ДанныеВыбора.ЗагрузитьЗначения(МассивЗначений);

	КонецЦикла;
		
	ПоказатьВыборИзСписка(ОписаниеОповещенияОЗакрытии, ДанныеВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкиЗаполнены(ВыбранныйЭлемент, ДопПараметры)  Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		
		ДопПараметры.ТекущийВариантОтвета = ВыбранныйЭлемент.Значение;
		
	КонецЕсли;
					 
КонецПроцедуры

&НаКлиенте
Процедура ВопросыТекущийВариантОтветаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Вопросы.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	ДанныеВыбора = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Ответы Цикл
		
		Если СтрокаТч.Вопрос = ТекСтрока.Вопрос Тогда
			
			ДанныеВыбора.Добавить();
			МассивЗначений = СтрокаТЧ.ВариантОтвета.ВыгрузитьЗначения();
			ДанныеВыбора.ЗагрузитьЗначения(МассивЗначений);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЯчейкиЗаполнены", ЭтаФорма, ТекСтрока);
	ПоказатьВыборИзСписка(ОписаниеОповещенияОЗакрытии, ДанныеВыбора, Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого Стр Из Объект.Вопросы Цикл
		Если НЕ Стр.ВариантОтвета = Стр.ТекущийВариантОтвета Тогда
			 Стр.ВариантОтвета =  Стр.ТекущийВариантОтвета;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПолучитьДанныеАнкеты(Истина);
	
КонецПроцедуры


