
&НаКлиенте
Процедура АдресаДоставкиАдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.АдресаДоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОбработкаЗакрытияФормыВводаАдреса = Новый ОписаниеОповещения("ЗавершенВводАдреса",ЭтаФорма,Новый Структура("ТекДанные",ТекДанные));
	ОткрытьФорму("ОбщаяФорма.ФормаВводаАдреса",,ЭтаФорма,,,,ОбработкаЗакрытияФормыВводаАдреса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершенВводАдреса(Результат,ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ТекДанные =  ДополнительныеПараметры.ТекДанные;
		
		ЗаполнитьЗначенияСвойств(ТекДанные,Результат);
		ТекДанные.АдресДоставки = ?(ТекДанные.Индекс=0,"",Формат(ТекДанные.Индекс,"ЧГ=0") + ", ")  +
														?(ПустаяСтрока(ТекДанные.Регион),"",ТекДанные.Регион + ", ")       +
														?(ПустаяСтрока(ТекДанные.Район),"",ТекДанные.Район + ", ")  +
														?(ПустаяСтрока(ТекДанные.НаселенныйПункт),"",ТекДанные.НаселенныйПункт + ", ")  +
														?(ПустаяСтрока(ТекДанные.Улица),"",ТекДанные.Улица + ", ")  +
														?(ПустаяСтрока(ТекДанные.Дом),"",ТекДанные.Дом + ", ");													
														
		ТекДанные.АдресДоставки = Лев(ТекДанные.АдресДоставки,СтрДлина(ТекДанные.АдресДоставки)-2);
		
	КонецЕсли;
	
КонецПроцедуры
