
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.СтраницыРегистрации.ТекущаяСтраница = Элементы.Авторизация Тогда
		
		Если НЕ ЗначениеЗаполнено(ВыбранныйСотрудник) Тогда
			
			Отказ = Истина;
			
		Иначе
			
			ФИО = УстановитьПараметрСеансаСотрудник(ВыбранныйСотрудник);
			//ПоказатьПредупреждение(,СтрШаблон("Добро пожаловать, %1.", ФИО),," ");
			
		КонецЕсли;
		
	Иначе
		
		Если ПустаяСтрока(ФИО) Тогда
			Отказ = Истина;
		Иначе
			ПоказатьПредупреждение(,СтрШаблон("Приятно познакомиться, %1.", ФИО),," ");
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьПараметрСеансаСотрудник(ВыбранныйСотрудник)
	
	ПараметрыСеанса.Сотрудник = ВыбранныйСотрудник;
	
	ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранныйСотрудник,"Наименование");
	
	Возврат ФИО;
	
КонецФункции

&НаКлиенте
Процедура Готово(Команда)
	
	Если ПустаяСтрока(ФИО) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатРегистрации = ЗарегистрироватьСотрудникаСервер(ФИО);
	Если НЕ РезультатРегистрации Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("ОбновитьСтандартныйЗаголовокГлавногоМеню");
	
	ЭтаФорма.Закрыть();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьСотрудникаСервер(Знач ФИО)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользователь.Имя = ФИО;
    НовыйПользователь.ПолноеИмя = ФИО;
    НовыйПользователь.АутентификацияСтандартная = Истина;
    НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
    НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
    НовыйПользователь.Записать();   
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	СотрудникОбъект = Справочники.Сотрудники.СоздатьЭлемент();
	СотрудникОбъект.Наименование = ФИО;
	СотрудникОбъект.ИдентификаторПользователяИБ = НовыйПользователь.Имя;
	СотрудникОбъект.Записать();	
	
	ЗафиксироватьТранзакцию();
	
	ПараметрыСеанса.Сотрудник = СотрудникОбъект.Ссылка;
	
	Возврат Истина;
	Исключение
		Сообщить("Попробуйте удалить необычные символы и цифры из имени");
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Попытка
		ВыбранныйСотрудник =  Элементы.Сотрудники.ТекущаяСтрока;
	Исключение
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ВыбранныйСотрудник) Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры
