
&НаКлиенте
Процедура КаталогТоваровИУслуг(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка");
	Сообщить("Каталог товаров и услуг (журналы, еда, бытовая химия и многое другое). Позволяет сразу наполнять корзину для заказчика.");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчётыПоЗаказамИПодпискам(Команда)
	
	Сообщить("Список отчётиков по заказам и подпискам. Помимо таких очевидных вещей как статистика по товарам, отчётики помогут узнать о приближающихся датах доставки и есть ли нужные заказчикам товары в запасах");
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаказИлиПодписку(Команда)
	
	ОткрытьФорму("Документ.ЗаказТоваровИУслуг.ФормаОбъекта");
	Сообщить("Оформление заказа и подписки для клиентов, которые сразу знают чего хотят и могут назвать товары и услуги для заказа. Однако функционал документа ""Заказ товаров и услуг"" так же позволяет почтальону добавить что-то из каталога");	
	
КонецПроцедуры
