
&НаКлиенте
Процедура ВопросыВопросНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивОтветов = Новый Массив;
	Для каждого Стр Из Объект.Вопросы Цикл
		Если НЕ ПустаяСтрока(Стр.Вопрос) и  МассивОтветов.Найти(Стр.Вопрос) = Неопределено Тогда
			МассивОтветов.Добавить(Стр.Вопрос);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОтветов.Количество() Тогда
	
	СписокОтветов = Новый СписокЗначений;
	СписокОтветов.ЗагрузитьЗначения(МассивОтветов);
	
	ОбработкаВыбораВМеню = Новый ОписаниеОповещения("ОкончаниеВыбораВопросаИзМеню", ЭтаФорма, Новый Структура("ТекДанные",ТекДанные));
	//ПоказатьВыборИзМеню(ОбработкаВыбораВМеню,СписокОтветов,Элемент);
	ПоказатьВыборИзСписка(ОбработкаВыбораВМеню,СписокОтветов,Элемент);
	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОкончаниеВыбораВопросаИзМеню(ВыбранныйВопрос,ДопПараметры) Экспорт
	
	ДопПараметры.ТекДанные.Вопрос = ВыбранныйВопрос;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВариантОтветаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	 ТекДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивОтветов = Новый Массив;
	Для каждого Стр Из Объект.Вопросы Цикл
		Если НЕ ПустаяСтрока(Стр.ВариантОтвета) и  МассивОтветов.Найти(Стр.ВариантОтвета) = Неопределено Тогда
			МассивОтветов.Добавить(Стр.ВариантОтвета);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ МассивОтветов.Количество() Тогда
		
		МассивДополнительныеОтветы = СтрРазделить("Да,Нет,Не знаю",",");
		Для каждого Ответ Из  МассивДополнительныеОтветы Цикл
			
			 Если МассивОтветов.Найти(Ответ) = Неопределено Тогда
				МассивОтветов.Добавить(Ответ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СписокОтветов = Новый СписокЗначений;
	СписокОтветов.ЗагрузитьЗначения(МассивОтветов);
	
	ОбработкаВыбораВМеню = Новый ОписаниеОповещения("ОкончаниеВыбораОтветаИзМеню", ЭтаФорма, Новый Структура("ТекДанные",ТекДанные));
	//ПоказатьВыборИзМеню(ОбработкаВыбораВМеню,СписокОтветов,Элемент);
	ПоказатьВыборИзСписка(ОбработкаВыбораВМеню,СписокОтветов,Элемент);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораОтветаИзМеню(ВыбранныйОтвет,ДопПараметры) Экспорт
	
	ДопПараметры.ТекДанные.ВариантОтвета = ВыбранныйОтвет;
	
КонецПроцедуры
